/*******************************************************************************
**
**      File NAME: swo_log.c
**
**      AUTHOR:  EmbeddedLab Of SWUST
**
**      CREATED: 2019-08-07
**
**      DESCRIPTION: 在 KEIL 中使用 SWO 配置 ST-LINK 实现 printf 功能
**
**      HISTORY:
**
**      Copyright 2015 ~ 2025 EmbeddedLab Of SWUST
**      All rights reserved.
**
**  概念缩写
**      SWD：Serial Wire Debug，串行线调试
**      SWO：Serial Wire Output，串行线输出
**      SWV：Serial Wire Viewer，串行线查看器
**      ITM：Instrumentation Trace Macrocell，指令跟踪宏单元
**
**  前提条件
**      ST-LINK 或 JLink 与 MCU 的连线至少包含 SWCLK SWDIO SWO GND 四条信号线，
**      其中 SWO 是用于串行输出的，必不可少，输出的数据可以借助 SWV 查看，SWV
**      可以使用：
**      1. 基于Keil的 Debug (printf) Viewer
**      2. 基于ST-LINK Utility的 Serial Wire Viewer
**      3. 基于IAR的 Terminal IO
**      4. 基于J-Link的 SWO Viewer
**
**
**  在 Keil 中打开工程设置 Options
**      1. Target
**          1. 勾选 Use Micro-LIB
**      2. Debug->Trace
**          1. Core Clock 配置为硬件时钟
**          2. 勾选 Trace Enable
**          3. 下方 TIM Stimulus Ports 中， Enable 值设置为 0x01，
**             Privilege 值设置为0x00
**      3. 下载程序，启动调试后打开 Debug (printf) viewer 窗口即可查看输出
*******************************************************************************/
/******************************************************************************/
/** INCLUDE FILES                                                            **/
/******************************************************************************/

#if 1
#include <stdio.h>

#include "stm32f4xx.h"


// ITM_SendChar说明
//      这个函数位于 core_cm3.h（或cm4 cm7）中，直接调用即可。
//  一般都使用 port0 无需修改
int fputc(int ch, FILE *f)
{
    ITM_SendChar(ch);
    return ch;
}

#endif



// 根据需要进行扩展的功能
#include "SwoPrintf.h"
unsigned long D_COUNT = 0, E_COUNT = 0;
unsigned long ESCAPE = 0;



/******************************************************************************/
/** LOCAL DEFINES                                                            **/
/******************************************************************************/



/******************************************************************************/
/** LOCAL TYPE DEFINITIONS                                                   **/
/******************************************************************************/



/******************************************************************************/
/** PRIVATE FUNCTION DECLARATIONS                                            **/
/******************************************************************************/



/******************************************************************************/
/** PRIVATE DATA DECLARATIONS                                                **/
/******************************************************************************/



/******************************************************************************/
/** EXPORTED PUBLIC DATA                                                     **/
/******************************************************************************/



/******************************************************************************/
/** EXPORTED PUBLIC FUNCTIONS                                                **/
/******************************************************************************/



/******************************************************************************/
/** PRIVATE MODULE FUNCTIONS                                                 **/
/******************************************************************************/






/***************** (C) COPYRIGHT EmbeddedLab Of SWUST *********END OF FILE*****/




